{
  "yoga_poses": [
    {
      "pose_name": "Yoganidrasana",
      "how_to_do_it": [
        "Lie on your back and lift your legs overhead, placing your feet behind your head.",
        "Clasp your hands behind your back and breathe deeply.",
        "Adjust your body to ensure comfort and maintain the position for a few breaths."
      ],
      "benefits": [
        "Enhances spinal flexibility.",
        "Reduces stress and promotes relaxation.",
        "Improves overall body awareness."
      ],
      "precautions": [
        "Avoid if you have neck or spine injuries.",
        "Practice under supervision if you're a beginner.",
        "Do not force the legs into position if it causes discomfort."
      ]
    },
    {
      "pose_name": "Vrischikasana",
      "how_to_do_it": [
        "Begin in a forearm stand, ensuring your elbows are shoulder-width apart.",
        "Engage your core and slowly arch your back, bringing your feet toward your head.",
        "Maintain balance by focusing your gaze and keeping your body steady."
      ],
      "benefits": [
        "Strengthens shoulders and core.",
        "Improves balance and concentration.",
        "Enhances flexibility of the spine."
      ],
      "precautions": [
        "Avoid if you have back or shoulder injuries.",
        "Ensure proper warm-up before attempting this pose.",
        "Practice with a spotter or near a wall for safety."
      ]
    },
    {
      "pose_name": "Vrikshasana",
      "how_to_do_it": [
        "Stand tall and shift your weight onto your left leg.",
        "Place the sole of your right foot on your inner left thigh or calf, avoiding the knee.",
        "Bring your hands together in a prayer position at your chest or raise them overhead.",
        "Hold the pose for 30 seconds to 1 minute, then switch sides."
      ],
      "benefits": [
        "Improves balance and stability.",
        "Strengthens thighs, calves, and ankles.",
        "Opens the hips and enhances focus."
      ],
      "precautions": [
        "Avoid placing the foot on the knee joint.",
        "Use a wall for support if necessary.",
        "Do not attempt if you have severe balance issues."
      ]
    },
    {
      "pose_name": "Virasana",
      "how_to_do_it": [
        "Kneel on the floor with your knees together and feet slightly apart.",
        "Sit back between your heels, keeping your spine straight and hands resting on your thighs.",
        "Hold the pose for 1-3 minutes, focusing on your breath."
      ],
      "benefits": [
        "Stretches thighs and improves posture.",
        "Aids digestion when practiced after meals.",
        "Relieves fatigue in the legs."
      ],
      "precautions": [
        "Avoid if you have knee or ankle injuries.",
        "Use a cushion under your hips for support if needed.",
        "Do not force your hips to the ground if it causes discomfort."
      ]
    },
    {
      "pose_name": "Viparita Karani",
      "how_to_do_it": [
        "Lie on your back and lift your legs up against a wall.",
        "Keep your arms relaxed by your sides and your head aligned with your spine.",
        "Hold the position for 5-15 minutes, breathing deeply."
      ],
      "benefits": [
        "Relieves leg fatigue.",
        "Improves circulation and reduces swelling.",
        "Calms the nervous system and promotes relaxation."
      ],
      "precautions": [
        "Avoid if you have glaucoma or severe back problems.",
        "Ensure the lower back is supported during the pose.",
        "Do not attempt if you feel discomfort in the neck or back."
      ]
    },
    {
      "pose_name": "Ustrasana",
      "how_to_do_it": [
        "Kneel on the floor with knees hip-width apart and thighs perpendicular to the ground.",
        "Place your hands on your lower back for support and lean back.",
        "Reach your hands to your heels while arching your back and dropping your head backward.",
        "Hold the pose for 20-30 seconds, then slowly return to the starting position."
      ],
      "benefits": [
        "Opens the chest and improves lung capacity.",
        "Strengthens the back and shoulders.",
        "Enhances flexibility in the spine."
      ],
      "precautions": [
        "Avoid if you have neck or lower back issues.",
        "Keep your neck supported to prevent strain.",
        "Do not overextend your lower back during the pose."
      ]
    },
    {
      "pose_name": "Tadasana",
      "how_to_do_it": [
        "Stand tall with your feet together and arms at your sides.",
        "Distribute your weight evenly across both feet.",
        "Engage your thighs, lift your kneecaps, and lengthen through the spine.",
        "Relax your shoulders and lift the crown of your head toward the ceiling.",
        "Hold the pose for 30 seconds to 1 minute while breathing deeply."
      ],
      "benefits": [
        "Improves posture.",
        "Strengthens thighs, knees, and ankles.",
        "Increases awareness and focus."
      ],
      "precautions": [
        "Avoid locking your knees.",
        "Maintain even weight distribution to prevent strain.",
        "Keep your spine neutral to avoid back discomfort."
      ]
    },
    {
      "pose_name": "Adho Mukha Svanasana",
      "how_to_do_it": [
        "Start on your hands and knees with hands shoulder-width apart.",
        "Tuck your toes under and lift your hips toward the ceiling, straightening your legs.",
        "Press your heels toward the floor and lengthen your spine.",
        "Spread your fingers wide and press firmly through your palms.",
        "Hold the pose for 1-3 minutes while breathing deeply."
      ],
      "benefits": [
        "Stretches the shoulders, hamstrings, and calves.",
        "Strengthens arms and legs.",
        "Relieves back pain and energizes the body."
      ],
      "precautions": [
        "Avoid if you have wrist or shoulder injuries.",
        "Bend your knees slightly if hamstrings are tight.",
        "Ensure even weight distribution to avoid wrist strain."
      ]
    },
    {
      "pose_name": "Savasana",
      "how_to_do_it": [
        "Lie flat on your back with arms and legs relaxed.",
        "Close your eyes and focus on your breath.",
        "Allow your body to relax completely, releasing tension in every part.",
        "Stay in the pose for 5-10 minutes for deep relaxation."
      ],
      "benefits": [
        "Promotes deep relaxation and stress relief.",
        "Rejuvenates the body and mind.",
        "Helps lower blood pressure and improve overall well-being."
      ],
      "precautions": [
        "Avoid practicing in noisy environments.",
        "Ensure a comfortable surface to lie on.",
        "Do not fall asleep during the pose for optimal benefits."
      ]
    },
    {
      "pose_name": "Paschimottanasana",
      "how_to_do_it": [
        "Sit on the floor with your legs extended straight in front of you.",
        "Inhale and lengthen your spine, reaching your arms overhead.",
        "Exhale and hinge at your hips, reaching your hands toward your feet.",
        "Keep your back straight and relax your head and neck.",
        "Hold the pose for 1-3 minutes, breathing deeply."
      ],
      "benefits": [
        "Stretches the spine, shoulders, and hamstrings.",
        "Calms the mind and relieves stress.",
        "Improves digestion and reduces fatigue."
      ],
      "precautions": [
        "Avoid if you have lower back injuries.",
        "Bend your knees slightly if hamstrings are tight.",
        "Do not force yourself into the pose to avoid strain."
      ]
    },
    {
      "pose_name": "Dhanurasana",
      "how_to_do_it": [
        "Lie on your stomach with your arms by your sides and legs straight.",
        "Bend your knees and reach your hands back to grab your ankles.",
        "Inhale and lift your chest and thighs off the ground, pulling your ankles up.",
        "Keep your gaze forward and hold the pose for 20-30 seconds, breathing steadily.",
        "Exhale and release back to the starting position."
      ],
      "benefits": [
        "Strengthens the back and core muscles.",
        "Stretches the shoulders, chest, and thighs.",
        "Improves posture and stimulates abdominal organs."
      ],
      "precautions": [
        "Avoid if you have back or neck injuries.",
        "Do not overarch your back to prevent strain.",
        "Practice on a soft surface for comfort."
      ]
    },
    {
      "pose_name": "Ardha Matsyendrasana",
      "how_to_do_it": [
        "Sit on the floor with your legs extended forward.",
        "Bend your right knee and place your right foot on the outside of your left thigh.",
        "Bend your left knee and bring your left foot near your right hip.",
        "Place your right hand behind you for support and your left elbow on the outside of your right knee.",
        "Twist your torso to the right, keeping your spine straight, and hold for 30 seconds to 1 minute.",
        "Repeat on the other side."
      ],
      "benefits": [
        "Increases spinal flexibility and mobility.",
        "Improves digestion and detoxifies the organs.",
        "Relieves tension in the back and shoulders."
      ],
      "precautions": [
        "Avoid if you have severe spinal injuries.",
        "Do not force the twist beyond your comfort level.",
        "Ensure your spine remains elongated during the pose."
      ]
    },
    {
      "pose_name": "Bhujangasana",
      "how_to_do_it": [
        "Lie on your stomach with your hands under your shoulders and elbows close to your body.",
        "Inhale and press into your palms to lift your chest off the ground, keeping your elbows slightly bent.",
        "Engage your back muscles and avoid straining your neck by looking forward or slightly upward.",
        "Hold the pose for 20-30 seconds, breathing deeply, then lower back down on an exhale."
      ],
      "benefits": [
        "Strengthens the spine and opens the chest.",
        "Improves flexibility in the shoulders and abdomen.",
        "Relieves stress and fatigue."
      ],
      "precautions": [
        "Avoid if you have wrist or lower back pain.",
        "Do not hyperextend your elbows.",
        "Keep your lower body relaxed to avoid strain."
      ]
    },
    {
      "pose_name": "Utkatasana",
      "how_to_do_it": [
        "Stand tall with your feet hip-width apart.",
        "Inhale and raise your arms overhead, keeping them parallel or with palms touching.",
        "Exhale and bend your knees, lowering your hips as if sitting back into a chair.",
        "Keep your chest lifted and your weight evenly distributed through your feet.",
        "Hold the pose for 30 seconds to 1 minute, then return to standing."
      ],
      "benefits": [
        "Strengthens thighs, calves, and core muscles.",
        "Improves balance and stability.",
        "Stretches the shoulders and chest."
      ],
      "precautions": [
        "Avoid if you have knee or lower back issues.",
        "Do not let your knees extend past your toes.",
        "Engage your core to support your lower back."
      ]
    },
    {
      "pose_name": "Ardha Chandrasana",
      "how_to_do_it": [
        "Start in Triangle Pose with your right foot forward.",
        "Place your right hand on the ground or a block in front of your right foot.",
        "Lift your left leg parallel to the floor while keeping your right leg straight.",
        "Extend your left arm upward and open your chest toward the ceiling, holding for 20-30 seconds."
      ],
      "benefits": [
        "Improves balance and coordination.",
        "Strengthens the legs, core, and spine.",
        "Enhances flexibility in the hips and shoulders."
      ],
      "precautions": [
        "Avoid if you have neck or shoulder injuries.",
        "Use a block for support if needed.",
        "Ensure stable footing to prevent falls."
      ]
    },
    {
      "pose_name": "Parsvottanasana",
      "how_to_do_it": [
        "Start in a lunge position with your right foot forward.",
        "Step your back foot slightly inward and straighten both legs.",
        "Square your hips to the front and fold forward over your right leg.",
        "Place your hands on the ground, blocks, or behind your back in a reverse prayer position."
      ],
      "benefits": [
        "Stretches the hamstrings, calves, and spine.",
        "Improves posture and balance.",
        "Calms the mind and relieves stress."
      ],
      "precautions": [
        "Avoid if you have hamstring or lower back injuries.",
        "Use blocks for support if needed.",
        "Ensure your hips remain squared to prevent strain."
      ]
    },
    {
      "pose_name": "Padangusthasana",
      "how_to_do_it": [
        "Stand tall with your feet hip-width apart.",
        "Fold forward from the hips and grab your big toes with your fingers.",
        "Keep your legs straight or slightly bent if necessary.",
        "Lengthen your spine and hold the pose for several breaths."
      ],
      "benefits": [
        "Stretches the hamstrings and calves.",
        "Strengthens the thighs and improves digestion.",
        "Calms the brain and reduces stress."
      ],
      "precautions": [
        "Avoid if you have lower back injuries.",
        "Bend your knees if you cannot reach your toes.",
        "Engage your core to protect your spine."
      ]
    },
    {
      "pose_name": "Upavistha Konasana",
      "how_to_do_it": [
        "Sit on the floor with your legs extended wide apart.",
        "Flex your feet and lengthen your spine.",
        "Fold forward from your hips, keeping your back straight.",
        "Place your hands on the floor in front of you or hold your feet."
      ],
      "benefits": [
        "Stretches the inner thighs, hamstrings, and spine.",
        "Improves flexibility in the hips.",
        "Calms the mind and relieves anxiety."
      ],
      "precautions": [
        "Avoid if you have groin or lower back injuries.",
        "Use a cushion or block for support if needed.",
        "Keep your back straight to avoid strain."
      ]
    },
    {
      "pose_name": "Bakasana",
      "how_to_do_it": [
        "Start in a squat position with your hands on the floor shoulder-width apart.",
        "Bend your elbows and lift your hips.",
        "Place your knees on the backs of your upper arms.",
        "Shift your weight forward and lift your feet off the ground, balancing on your hands."
      ],
      "benefits": [
        "Strengthens the arms, shoulders, and core.",
        "Improves balance and concentration.",
        "Builds confidence and focus."
      ],
      "precautions": [
        "Avoid if you have wrist or shoulder injuries.",
        "Practice on a soft surface to prevent falls.",
        "Engage your core to maintain balance."
      ]
    },
    {
      "pose_name": "Marichyasana I",
      "how_to_do_it": [
        "Sit on the floor with your legs extended.",
        "Bend your right knee and place your foot on the floor close to your pelvis.",
        "Twist your torso toward your right leg and wrap your right arm around your shin.",
        "Clasp your hands behind your back or use a strap if needed."
      ],
      "benefits": [
        "Stretches the spine, shoulders, and hips.",
        "Massages abdominal organs and improves digestion.",
        "Calms the mind and relieves stress."
      ],
      "precautions": [
        "Avoid if you have lower back or shoulder injuries.",
        "Use a strap if you cannot clasp your hands.",
        "Keep your spine long and avoid rounding your back."
      ]
    },
    {
      "pose_name": "Setu Bandha Sarvangasana",
      "how_to_do_it": [
        "Lie on your back with your knees bent and feet hip-width apart.",
        "Press your feet and arms into the ground as you lift your hips.",
        "Clasp your hands underneath your back and straighten your arms.",
        "Hold the pose for 20-30 seconds, then lower your hips slowly."
      ],
      "benefits": [
        "Strengthens the back, glutes, and legs.",
        "Opens the chest and improves lung capacity.",
        "Calms the mind and reduces anxiety."
      ],
      "precautions": [
        "Avoid if you have neck or back injuries.",
        "Use a block under your sacrum for support if needed.",
        "Keep your knees aligned with your hips."
      ]
    },
    {
      "pose_name": "Gomukhasana",
      "how_to_do_it": [
        "Sit on the floor with your legs extended.",
        "Cross your right leg over your left, stacking your knees.",
        "Reach your right arm overhead and bend your elbow.",
        "Bring your left arm behind your back and clasp your hands, using a strap if necessary."
      ],
      "benefits": [
        "Stretches the shoulders, chest, and hips.",
        "Improves posture and flexibility.",
        "Relieves tension in the shoulders and upper back."
      ],
      "precautions": [
        "Avoid if you have shoulder or knee injuries.",
        "Sit on a cushion if your hips are tight.",
        "Use a strap if you cannot clasp your hands."
      ]
    },
    {
      "pose_name": "Anjaneyasana",
      "how_to_do_it": [
        "Start in a low lunge position with your right foot forward.",
        "Lower your left knee to the ground and point your toes back.",
        "Lift your torso and extend your arms overhead.",
        "Hold the pose for several breaths, then switch sides."
      ],
      "benefits": [
        "Stretches the hips, thighs, and groin.",
        "Strengthens the legs and core.",
        "Improves balance and concentration."
      ],
      "precautions": [
        "Avoid if you have knee or hip injuries.",
        "Place a cushion under your back knee for support.",
        "Keep your front knee aligned over your ankle."
      ]
    },
    {
      "pose_name": "Halasana",
      "how_to_do_it": [
        "Lie on your back and lift your legs overhead.",
        "Lower your toes to the floor behind your head, keeping your legs straight.",
        "Place your hands on your back for support or interlace your fingers on the floor.",
        "Hold the pose for 20-30 seconds, then slowly roll out."
      ],
      "benefits": [
        "Stretches the shoulders, spine, and hamstrings.",
        "Calms the brain and reduces stress.",
        "Stimulates the thyroid and abdominal organs."
      ],
      "precautions": [
        "Avoid if you have neck or back issues.",
        "Practice under guidance if you are a beginner.",
        "Use props for support if needed."
      ]
    },
    {
      "pose_name": "Utkatasana",
      "how_to_do_it": [
        "Stand with your feet together and arms at your sides.",
        "Bend your knees and lower your hips as if sitting in a chair.",
        "Extend your arms overhead and keep your chest lifted.",
        "Hold the pose for several breaths, keeping your weight in your heels."
      ],
      "benefits": [
        "Strengthens the thighs, calves, and spine.",
        "Improves balance and endurance.",
        "Stimulates the heart and diaphragm."
      ],
      "precautions": [
        "Avoid if you have knee or lower back pain.",
        "Keep your knees aligned with your toes.",
        "Engage your core to protect your lower back."
      ]
    },
    {
      "pose_name": "Vasisthasana",
      "how_to_do_it": [
        "Start in a plank position with your shoulders over your wrists.",
        "Shift your weight onto your right hand and the outer edge of your right foot.",
        "Stack your left foot on top of your right foot and lift your left arm towards the ceiling.",
        "Hold the pose for several breaths, then switch sides."
      ],
      "benefits": [
        "Strengthens the arms, core, and legs.",
        "Improves balance and focus.",
        "Enhances flexibility in the wrists and shoulders."
      ],
      "precautions": [
        "Avoid if you have wrist, elbow, or shoulder injuries.",
        "Use your bottom knee for support if needed.",
        "Engage your core to maintain balance."
      ]
    },
    {
      "pose_name": "Vajrasana",
      "how_to_do_it": [
        "Kneel on the floor with your knees together and your feet flat.",
        "Sit back on your heels and place your hands on your thighs.",
        "Keep your back straight and gaze forward.",
        "Hold the pose for several minutes while breathing deeply."
      ],
      "benefits": [
        "Improves digestion and reduces bloating.",
        "Strengthens the lower back and thighs.",
        "Promotes relaxation and mindfulness."
      ],
      "precautions": [
        "Avoid if you have knee or ankle injuries.",
        "Use a cushion under your hips for comfort.",
        "Keep your spine elongated to avoid slouching."
      ]
    },
    {
      "pose_name": "Utthita Trikonasana",
      "how_to_do_it": [
        "Stand with your feet wide apart and arms extended to the sides.",
        "Turn your right foot out and your left foot slightly in.",
        "Reach your right hand down to your shin or the floor while extending your left arm upwards.",
        "Keep your chest open and gaze towards your left hand, holding for several breaths."
      ],
      "benefits": [
        "Stretches the legs, hips, and spine.",
        "Strengthens the thighs, knees, and ankles.",
        "Improves balance and stability."
      ],
      "precautions": [
        "Avoid if you have neck or back injuries.",
        "Use a block for support if you cannot reach the floor.",
        "Keep your legs engaged to prevent hyperextension."
      ]
    },
    {
      "pose_name": "Utthita Parsvakonasana",
      "how_to_do_it": [
        "Start in a lunge position with your right foot forward.",
        "Place your right hand on the ground or a block beside your right foot.",
        "Extend your left arm overhead, creating a straight line from your left foot to your fingertips.",
        "Keep your chest open and hold the pose for several breaths before switching sides."
      ],
      "benefits": [
        "Stretches the hips, groin, and sides of the torso.",
        "Strengthens the legs, knees, and ankles.",
        "Improves stamina and endurance."
      ],
      "precautions": [
        "Avoid if you have knee or shoulder injuries.",
        "Use a block for support to avoid strain.",
        "Keep your front knee aligned over your ankle."
      ]
    },
    {
      "pose_name": "Utthita Hasta Padangusthasana",
      "how_to_do_it": [
        "Stand tall with your feet together and arms at your sides.",
        "Lift your right leg and grab your big toe with your right hand.",
        "Extend your right leg forward or to the side while keeping your back straight.",
        "Hold the pose for several breaths, then switch sides."
      ],
      "benefits": [
        "Improves balance and focus.",
        "Strengthens the legs and core.",
        "Enhances flexibility in the hamstrings and hips."
      ],
      "precautions": [
        "Avoid if you have ankle or knee injuries.",
        "Use a strap if you cannot reach your foot.",
        "Engage your standing leg for stability."
      ]
    },
    {
      "pose_name": "Utthita Ashwa Sanchalanasana",
      "how_to_do_it": [
        "Start in a low lunge position with your right foot forward.",
        "Extend your arms overhead and lengthen your spine.",
        "Keep your back leg straight and your front knee aligned over your ankle.",
        "Hold the pose for several breaths, then switch sides."
      ],
      "benefits": [
        "Stretches the hips, thighs, and groin.",
        "Strengthens the legs and core.",
        "Improves balance and posture."
      ],
      "precautions": [
        "Avoid if you have knee or hip injuries.",
        "Place a cushion under your back knee for support if needed.",
        "Keep your front knee aligned over your ankle."
      ]
    },
    {
      "pose_name": "Uttanasana",
      "how_to_do_it": [
        "Stand tall with your feet together and arms at your sides.",
        "Fold forward from your hips and let your head hang.",
        "Place your hands on the floor or grab your ankles.",
        "Keep your legs straight or slightly bent if necessary."
      ],
      "benefits": [
        "Stretches the hamstrings, calves, and spine.",
        "Calms the brain and relieves stress.",
        "Improves digestion and blood circulation."
      ],
      "precautions": [
        "Avoid if you have lower back injuries.",
        "Bend your knees if you cannot reach the floor.",
        "Engage your core to protect your lower back."
      ]
    },
    {
      "pose_name": "Uttana Shishosana",
      "how_to_do_it": [
        "Start on your hands and knees in a tabletop position.",
        "Walk your hands forward and lower your chest toward the ground.",
        "Keep your hips over your knees and your forehead on the floor.",
        "Hold the pose for several breaths, relaxing your shoulders."
      ],
      "benefits": [
        "Stretches the spine and shoulders.",
        "Calms the mind and relieves stress.",
        "Opens the chest and improves lung capacity."
      ],
      "precautions": [
        "Avoid if you have shoulder or neck injuries.",
        "Use a cushion under your chest for support if needed.",
        "Keep your hips aligned over your knees."
      ]
    },
    {
      "pose_name": "Urdhva Prasarita Eka Padasana",
      "how_to_do_it": [
        "Start in a standing forward fold position.",
        "Lift your right leg straight back and up, keeping your hips level.",
        "Place your hands on the floor or blocks for support.",
        "Hold the pose for several breaths, then switch sides."
      ],
      "benefits": [
        "Strengthens the legs and core.",
        "Improves balance and flexibility.",
        "Stretches the hamstrings and calves."
      ],
      "precautions": [
        "Avoid if you have lower back or hamstring injuries.",
        "Use blocks for support if needed.",
        "Keep your lifted leg active and your hips level."
      ]
    },
    {
      "pose_name": "Urdhva Mukha Svanasana",
      "how_to_do_it": [
        "Lie on your stomach with your legs extended and tops of your feet on the ground.",
        "Place your hands under your shoulders and straighten your arms.",
        "Lift your chest and thighs off the ground, opening your chest.",
        "Hold the pose for several breaths, keeping your shoulders away from your ears."
      ],
      "benefits": [
        "Strengthens the arms, wrists, and spine.",
        "Opens the chest and lungs.",
        "Improves posture and stimulates abdominal organs."
      ],
      "precautions": [
        "Avoid if you have wrist or lower back injuries.",
        "Engage your core to protect your lower back.",
        "Keep your shoulders relaxed and away from your ears."
      ]
    },
    {
      "pose_name": "Tulasana",
      "how_to_do_it": [
        "Sit in Padmasana (Lotus Pose) with your hands on the ground beside your hips.",
        "Press your palms into the ground and lift your body off the floor.",
        "Engage your core and hold for several breaths.",
        "Lower yourself back to the ground gently."
      ],
      "benefits": [
        "Strengthens the arms, shoulders, and core.",
        "Improves focus and balance.",
        "Increases upper body strength."
      ],
      "precautions": [
        "Avoid if you have wrist or shoulder injuries.",
        "Ensure your Padmasana is stable before lifting.",
        "Use padding under your hands if necessary."
      ]
    },
    {
      "pose_name": "Tolasana",
      "how_to_do_it": [
        "Begin in Padmasana (Lotus Pose).",
        "Place your palms on the floor beside your hips.",
        "Engage your core and lift your body off the ground using your arms.",
        "Hold the pose for several breaths and then release."
      ],
      "benefits": [
        "Builds arm and shoulder strength.",
        "Improves balance and concentration.",
        "Engages the core muscles effectively."
      ],
      "precautions": [
        "Avoid if you have wrist or shoulder issues.",
        "Practice on a stable, non-slip surface.",
        "Warm up your wrists before attempting."
      ]
    },
    {
      "pose_name": "Tittibhasana",
      "how_to_do_it": [
        "Start in a squatting position with your feet slightly apart.",
        "Thread your arms under your thighs and place your hands on the floor.",
        "Shift your weight onto your hands and lift your legs off the floor.",
        "Straighten your legs outward and hold for a few breaths."
      ],
      "benefits": [
        "Strengthens the arms, core, and shoulders.",
        "Improves flexibility in the hips and hamstrings.",
        "Enhances overall balance and focus."
      ],
      "precautions": [
        "Avoid if you have wrist or shoulder injuries.",
        "Warm up your hips and hamstrings before practicing.",
        "Use a block for support if needed."
      ]
    },
    {
      "pose_name": "Supta Virasana",
      "how_to_do_it": [
        "Sit in Virasana (Hero Pose) with your knees together and feet apart.",
        "Slowly lean back, supporting yourself with your hands and elbows.",
        "Lower your back onto the floor and rest your arms beside you.",
        "Hold for several breaths and then come out slowly."
      ],
      "benefits": [
        "Stretches the thighs, hips, and abdomen.",
        "Relieves tired legs and improves digestion.",
        "Calms the mind and reduces stress."
      ],
      "precautions": [
        "Avoid if you have knee, back, or ankle injuries.",
        "Use a bolster or cushion for support if needed.",
        "Come out of the pose gently to avoid strain."
      ]
    },
    {
      "pose_name": "Supta Padangusthasana",
      "how_to_do_it": [
        "Lie on your back with your legs extended.",
        "Lift your right leg and grab your big toe with your right hand or use a strap.",
        "Keep your left leg grounded and your hips aligned.",
        "Hold the pose for several breaths and then switch sides."
      ],
      "benefits": [
        "Stretches the hamstrings, calves, and lower back.",
        "Improves flexibility in the hips.",
        "Relieves tension in the legs and lower back."
      ],
      "precautions": [
        "Avoid if you have hamstring or lower back injuries.",
        "Use a strap if you cannot reach your foot.",
        "Keep your head and neck relaxed on the floor."
      ]
    },
    {
      "pose_name": "Supta Matsyendrasana",
      "how_to_do_it": [
        "Lie on your back with your arms extended out to the sides.",
        "Bring your right knee towards your chest and cross it over to the left side.",
        "Turn your head to the right and hold the pose for several breaths.",
        "Repeat on the other side."
      ],
      "benefits": [
        "Stretches the spine, shoulders, and hips.",
        "Improves spinal mobility and digestion.",
        "Relieves tension in the lower back."
      ],
      "precautions": [
        "Avoid if you have spine or hip injuries.",
        "Keep your movements gentle and controlled.",
        "Use a cushion under your knee for support if needed."
      ]
    },
    {
      "pose_name": "Sukhasana",
      "how_to_do_it": [
        "Sit on the floor with your legs crossed and your spine straight.",
        "Rest your hands on your knees or in your lap.",
        "Relax your shoulders and gaze forward or close your eyes.",
        "Breathe deeply and hold for several minutes."
      ],
      "benefits": [
        "Promotes relaxation and mental clarity.",
        "Improves posture and flexibility in the hips.",
        "Encourages a sense of calm and mindfulness."
      ],
      "precautions": [
        "Avoid if you have hip or knee issues.",
        "Sit on a cushion if needed to elevate your hips.",
        "Keep your spine straight to avoid slouching."
      ]
    },
    {
      "pose_name": "Simhasana",
      "how_to_do_it": [
        "Sit in a kneeling position with your hands on your thighs.",
        "Lean forward slightly, open your mouth wide, and stick out your tongue.",
        "Roar like a lion while exhaling forcefully.",
        "Repeat for a few breaths and then relax."
      ],
      "benefits": [
        "Relieves tension in the face and throat.",
        "Stimulates the vocal cords and respiratory system.",
        "Encourages self-expression and reduces stress."
      ],
      "precautions": [
        "Avoid if you have throat or jaw issues.",
        "Practice in a comfortable and private setting.",
        "Keep your back straight and avoid straining your neck."
      ]
    },
    {
      "pose_name": "Salamba Sirsasana",
      "how_to_do_it": [
        "Kneel on the floor and interlace your fingers to create a base for your head.",
        "Place the crown of your head on the floor with your hands supporting it.",
        "Lift your legs off the ground and extend them upward.",
        "Hold the pose while maintaining balance and then lower gently."
      ],
      "benefits": [
        "Improves circulation to the brain.",
        "Strengthens the arms, shoulders, and core.",
        "Enhances focus and relieves stress."
      ],
      "precautions": [
        "Avoid if you have neck or shoulder injuries.",
        "Practice near a wall for support if needed.",
        "Engage your core to protect your neck."
      ]
    },
    {
      "pose_name": "Salamba Sarvangasana",
      "how_to_do_it": [
        "Lie on your back and lift your legs upward.",
        "Support your lower back with your hands as you lift your hips.",
        "Extend your legs straight up and hold the pose.",
        "Lower yourself gently after a few breaths."
      ],
      "benefits": [
        "Improves blood flow to the upper body.",
        "Strengthens the shoulders, neck, and core.",
        "Relieves fatigue and improves thyroid function."
      ],
      "precautions": [
        "Avoid if you have neck or shoulder injuries.",
        "Use a folded blanket under your shoulders for support.",
        "Keep your head still to avoid strain."
      ]
    },
    {
      "pose_name": "Salamba Bhujangasana",
      "how_to_do_it": [
        "Lie on your stomach with your elbows under your shoulders.",
        "Press your forearms into the ground and lift your chest.",
        "Keep your shoulders relaxed and gaze forward.",
        "Hold the pose for several breaths."
      ],
      "benefits": [
        "Strengthens the spine and shoulders.",
        "Opens the chest and lungs.",
        "Relieves stress and fatigue."
      ],
      "precautions": [
        "Avoid if you have lower back pain or injuries.",
        "Engage your core to support your back.",
        "Keep your elbows aligned under your shoulders."
      ]
    },
    {
      "pose_name": "Salabhasana",
      "how_to_do_it": [
        "Lie on your stomach with your arms alongside your body.",
        "Lift your chest, arms, and legs off the ground simultaneously.",
        "Keep your gaze forward and hold the pose for a few breaths.",
        "Lower yourself back to the ground gently."
      ],
      "benefits": [
        "Strengthens the back, glutes, and legs.",
        "Improves posture and spinal flexibility.",
        "Stimulates the abdominal organs."
      ],
      "precautions": [
        "Avoid if you have neck or lower back injuries.",
        "Engage your core to protect your lower back.",
        "Keep your neck in a neutral position."
      ]
    },
    {
      "pose_name": "Purvottanasana",
      "how_to_do_it": [
        "Sit with your legs extended in front of you and your hands placed behind your hips, fingers pointing forward.",
        "Press into your palms and lift your hips upward, forming a straight line from your head to your feet.",
        "Keep your shoulders open and your neck relaxed.",
        "Hold for several breaths, then lower your hips gently back to the floor."
      ],
      "benefits": [
        "Strengthens the arms, wrists, and legs.",
        "Stretches the chest, shoulders, and front of the body.",
        "Improves posture and energizes the body."
      ],
      "precautions": [
        "Avoid if you have wrist or shoulder injuries.",
        "Engage your core to prevent lower back strain.",
        "Practice on a stable, non-slip surface."
      ]
    },
    {
      "pose_name": "Prasarita Padottanasana",
      "how_to_do_it": [
        "Stand with your feet wide apart and your hands on your hips.",
        "Inhale, lengthen your spine, and exhale as you fold forward from your hips.",
        "Place your hands on the floor or on blocks for support.",
        "Hold for several breaths and then slowly rise back to standing."
      ],
      "benefits": [
        "Stretches the hamstrings, calves, and spine.",
        "Strengthens the legs and back.",
        "Calms the mind and relieves stress."
      ],
      "precautions": [
        "Avoid if you have lower back or hamstring injuries.",
        "Keep your knees slightly bent if needed to avoid strain.",
        "Engage your core to protect your lower back."
      ]
    },
    {
      "pose_name": "Pincha Mayurasana",
      "how_to_do_it": [
        "Start in Dolphin Pose with your forearms on the floor and your elbows shoulder-width apart.",
        "Walk your feet closer to your elbows to lift your hips.",
        "Kick one leg up, followed by the other, to balance on your forearms.",
        "Hold the pose while keeping your core engaged and your gaze steady."
      ],
      "benefits": [
        "Strengthens the shoulders, arms, and core.",
        "Improves balance and concentration.",
        "Enhances flexibility in the spine and shoulders."
      ],
      "precautions": [
        "Avoid if you have shoulder, neck, or back injuries.",
        "Practice near a wall for support if you're a beginner.",
        "Warm up your shoulders and wrists before attempting."
      ]
    },
    {
      "pose_name": "Pasasana",
      "how_to_do_it": [
        "Start in a squatting position with your feet together and your knees bent.",
        "Wrap one arm around your knees and the other arm behind your back to clasp your hands.",
        "Twist your torso towards the clasped hands and hold the pose.",
        "Repeat on the other side."
      ],
      "benefits": [
        "Improves spinal mobility and digestion.",
        "Strengthens the ankles and stretches the thighs.",
        "Enhances balance and detoxifies the body."
      ],
      "precautions": [
        "Avoid if you have knee or lower back injuries.",
        "Use a block under your heels if needed for balance.",
        "Keep your twist gentle and controlled."
      ]
    },
    {
      "pose_name": "Parsva Bakasana",
      "how_to_do_it": [
        "Start in a squatting position and place your hands on the floor in front of you.",
        "Twist your torso to one side and place your elbow against the outer thigh.",
        "Shift your weight onto your hands and lift your feet off the floor.",
        "Hold the pose for a few breaths and then repeat on the other side."
      ],
      "benefits": [
        "Strengthens the arms, shoulders, and core.",
        "Improves balance and concentration.",
        "Enhances spinal flexibility and detoxifies the body."
      ],
      "precautions": [
        "Avoid if you have wrist or shoulder injuries.",
        "Practice on a stable, non-slip surface.",
        "Engage your core to maintain balance."
      ]
    },
    {
      "pose_name": "Parivrtta Trikonasana",
      "how_to_do_it": [
        "Start in Triangle Pose with your right foot forward.",
        "Twist your torso and place your left hand on the ground or a block outside your right foot.",
        "Extend your right arm upward and gaze at your fingertips.",
        "Hold the pose for several breaths and then switch sides."
      ],
      "benefits": [
        "Stretches the legs, spine, and shoulders.",
        "Improves balance and digestion.",
        "Strengthens the legs and core."
      ],
      "precautions": [
        "Avoid if you have spine or hip injuries.",
        "Use a block for support if needed.",
        "Keep your movements slow and controlled."
      ]
    },
    {
      "pose_name": "Parivrtta Parsvakonasana",
      "how_to_do_it": [
        "Begin in Warrior I with your right foot forward.",
        "Bring your left elbow to the outside of your right thigh and join your palms in a prayer position.",
        "Twist your torso to the right and gaze upward.",
        "Hold for several breaths and then repeat on the other side."
      ],
      "benefits": [
        "Strengthens the legs and core.",
        "Stretches the spine, shoulders, and hips.",
        "Improves balance and detoxifies the body."
      ],
      "precautions": [
        "Avoid if you have knee or spine injuries.",
        "Use a block under your hand for support if needed.",
        "Keep your movements gentle and controlled."
      ]
    },
    {
      "pose_name": "Parivrtta Janu Sirsasana",
      "how_to_do_it": [
        "Sit with one leg extended and the other foot against your inner thigh.",
        "Twist your torso towards the extended leg and reach your opposite arm towards your foot.",
        "Hold the pose while keeping your spine elongated.",
        "Repeat on the other side."
      ],
      "benefits": [
        "Stretches the hamstrings, spine, and shoulders.",
        "Improves flexibility in the hips.",
        "Stimulates the abdominal organs and improves digestion."
      ],
      "precautions": [
        "Avoid if you have hamstring or lower back injuries.",
        "Use a strap if you cannot reach your foot.",
        "Keep your neck relaxed and aligned."
      ]
    },
    {
      "pose_name": "Paripurna Navasana",
      "how_to_do_it": [
        "Sit on the floor with your knees bent and your feet flat.",
        "Lean back slightly and lift your feet off the ground, balancing on your sit bones.",
        "Extend your legs and arms straight out, forming a V shape with your body.",
        "Hold the pose while engaging your core."
      ],
      "benefits": [
        "Strengthens the core, hip flexors, and spine.",
        "Improves balance and posture.",
        "Stimulates the abdominal organs."
      ],
      "precautions": [
        "Avoid if you have lower back or neck injuries.",
        "Keep your spine straight to prevent strain.",
        "Bend your knees if needed for balance."
      ]
    },
    {
      "pose_name": "Parighasana",
      "how_to_do_it": [
        "Kneel on the floor and extend your right leg out to the side.",
        "Place your right hand on your right leg and stretch your left arm overhead.",
        "Bend sideways towards your extended leg while keeping your chest open.",
        "Hold the pose and then switch sides."
      ],
      "benefits": [
        "Stretches the sides of the body, spine, and hamstrings.",
        "Improves flexibility in the hips and shoulders.",
        "Enhances overall body alignment and posture."
      ],
      "precautions": [
        "Avoid if you have knee or shoulder injuries.",
        "Use a block under your hand for support if needed.",
        "Keep your movements slow and controlled."
      ]
    },
    {
      "pose_name": "Padmasana",
      "how_to_do_it": [
        "Sit on the floor with your legs extended.",
        "Bend your right knee and place your right foot on your left thigh.",
        "Repeat with your left leg, placing your left foot on your right thigh.",
        "Rest your hands on your knees and hold the pose while breathing deeply."
      ],
      "benefits": [
        "Calms the mind and promotes relaxation.",
        "Improves flexibility in the hips and knees.",
        "Encourages proper posture and meditation focus."
      ],
      "precautions": [
        "Avoid if you have knee or ankle injuries.",
        "Practice on a cushion if your hips are tight.",
        "Do not force your legs into the position."
      ]
    },
    {
      "pose_name": "Natarajasana",
      "how_to_do_it": [
        "Stand upright and shift your weight onto your right foot.",
        "Bend your left knee and grab your left ankle with your left hand.",
        "Stretch your right arm forward and lift your left leg behind you.",
        "Hold the pose while keeping your chest open and balanced."
      ],
      "benefits": [
        "Improves balance and concentration.",
        "Strengthens the legs, hips, and spine.",
        "Stretches the chest, shoulders, and thighs."
      ],
      "precautions": [
        "Avoid if you have knee or ankle injuries.",
        "Use a wall for support if you're a beginner.",
        "Warm up your body before attempting this pose."
      ]
    },
    {
      "pose_name": "Mayurasana",
      "how_to_do_it": [
        "Kneel on the floor and place your palms flat with fingers pointing backward.",
        "Bring your elbows close to your abdomen and lean forward.",
        "Lift your legs off the floor, balancing your body on your hands.",
        "Hold the pose while keeping your core engaged."
      ],
      "benefits": [
        "Strengthens the wrists, arms, and core.",
        "Improves digestion and tones the abdominal organs.",
        "Enhances focus and balance."
      ],
      "precautions": [
        "Avoid if you have wrist or shoulder injuries.",
        "Practice on a padded surface to avoid strain.",
        "Engage your core to maintain stability."
      ]
    },
    {
      "pose_name": "Matsyasana",
      "how_to_do_it": [
        "Lie on your back with your legs extended and arms at your sides.",
        "Slide your hands under your hips and lift your chest upward.",
        "Let the crown of your head rest gently on the floor.",
        "Hold the pose while breathing deeply."
      ],
      "benefits": [
        "Stretches the neck, chest, and spine.",
        "Relieves tension in the shoulders and neck.",
        "Improves posture and respiratory function."
      ],
      "precautions": [
        "Avoid if you have neck or back injuries.",
        "Support your head with a block if needed.",
        "Keep the pose gentle and controlled."
      ]
    },
    {
      "pose_name": "Marjaryasana",
      "how_to_do_it": [
        "Start on all fours with your wrists under shoulders and knees under hips.",
        "Inhale, arch your back, and lift your head and tailbone toward the ceiling.",
        "Exhale, round your back, tucking your chin and tailbone.",
        "Repeat the movements in coordination with your breath."
      ],
      "benefits": [
        "Improves spinal flexibility and mobility.",
        "Stretches the neck and back muscles.",
        "Relieves stress and tension."
      ],
      "precautions": [
        "Avoid if you have wrist or knee injuries.",
        "Use a blanket under your knees for comfort.",
        "Move gently to avoid strain."
      ]
    },
    {
      "pose_name": "Marichyasana III",
      "how_to_do_it": [
        "Sit with one leg extended and the other knee bent, foot flat on the floor.",
        "Twist your torso towards the bent knee and place your opposite elbow on the outside of the knee.",
        "Place your other hand behind you for support.",
        "Hold the pose and then switch sides."
      ],
      "benefits": [
        "Improves spinal flexibility and digestion.",
        "Stretches the shoulders and back.",
        "Detoxifies the body through gentle twisting."
      ],
      "precautions": [
        "Avoid if you have spine or hip injuries.",
        "Keep your twist gentle and avoid forcing your body.",
        "Practice on a firm, stable surface."
      ]
    },
    {
      "pose_name": "Malasana",
      "how_to_do_it": [
        "Start in a standing position with your feet slightly wider than hip-width apart.",
        "Squat down, bringing your hips close to the floor.",
        "Bring your palms together in a prayer position and press your elbows against your inner knees.",
        "Hold the pose while keeping your spine elongated."
      ],
      "benefits": [
        "Opens the hips and stretches the groin and ankles.",
        "Improves balance and posture.",
        "Aids in digestion and strengthens the lower body."
      ],
      "precautions": [
        "Avoid if you have knee or ankle injuries.",
        "Place a block under your hips for support if needed.",
        "Keep your feet grounded to maintain stability."
      ]
    },
    {
      "pose_name": "Makarasana",
      "how_to_do_it": [
        "Lie on your stomach with your arms folded under your head.",
        "Rest your forehead on your hands and relax your entire body.",
        "Let your heels drop outward and breathe deeply.",
        "Stay in the pose for as long as needed."
      ],
      "benefits": [
        "Relaxes the body and calms the mind.",
        "Releases tension in the lower back and spine.",
        "Improves breathing and reduces stress."
      ],
      "precautions": [
        "Avoid if you have severe back pain or injuries.",
        "Use a folded blanket under your chest for comfort.",
        "Breathe naturally and avoid any strain."
      ]
    },
    {
      "pose_name": "Makara Adho Mukha Svanasana",
      "how_to_do_it": [
        "Start in Dolphin Pose with your forearms on the floor and your hips lifted.",
        "Extend your body forward into a plank position, keeping your core engaged.",
        "Maintain a straight line from your head to your heels.",
        "Hold the pose for several breaths."
      ],
      "benefits": [
        "Strengthens the shoulders, arms, and core.",
        "Improves balance and posture.",
        "Enhances focus and stamina."
      ],
      "precautions": [
        "Avoid if you have shoulder or wrist injuries.",
        "Engage your core to prevent sagging in the lower back.",
        "Practice on a stable, non-slip surface."
      ]
    },
    {
      "pose_name": "Lolasana",
      "how_to_do_it": [
        "Sit in a cross-legged position and place your palms flat on the floor beside your hips.",
        "Engage your core and lift your body off the ground, balancing on your hands.",
        "Hold the pose while keeping your legs and feet crossed.",
        "Lower yourself gently back to the floor."
      ],
      "benefits": [
        "Strengthens the arms, shoulders, and core.",
        "Improves balance and focus.",
        "Enhances wrist and forearm endurance."
      ],
      "precautions": [
        "Avoid if you have wrist or shoulder injuries.",
        "Use blocks under your hands for additional height if needed.",
        "Engage your core to maintain balance."
      ]
    },
    {
      "pose_name": "Kurmasana",
      "how_to_do_it": [
        "Sit with your legs extended and slightly apart.",
        "Fold forward, sliding your arms under your legs and reaching them out to the sides.",
        "Rest your chest on the floor and relax your head.",
        "Hold the pose while breathing deeply."
      ],
      "benefits": [
        "Stretches the back, shoulders, and hips.",
        "Calms the mind and reduces stress.",
        "Improves flexibility in the hamstrings and spine."
      ],
      "precautions": [
        "Avoid if you have lower back or hip injuries.",
        "Use a folded blanket under your hips for support.",
        "Move gently to avoid overstretching."
      ]
    },
    {
      "pose_name": "Krounchasana",
      "how_to_do_it": [
        "Sit with one leg bent and the other leg extended straight in front of you.",
        "Hold the extended foot with both hands and lift it toward the ceiling.",
        "Keep your back straight and your gaze forward.",
        "Hold the pose and then switch sides."
      ],
      "benefits": [
        "Stretches the hamstrings and calves.",
        "Improves spinal flexibility and posture.",
        "Strengthens the core and improves focus."
      ],
      "precautions": [
        "Avoid if you have hamstring or lower back injuries.",
        "Use a strap if you cannot reach your foot.",
        "Keep your spine elongated to prevent strain."
      ]
    },
    {
      "pose_name": "Kapotasana",
      "how_to_do_it": [
        "Start in a kneeling position and lower your hips toward your heels.",
        "Lift your chest and arch your back, reaching your hands to your heels.",
        "Let your head drop back gently while keeping your chest open.",
        "Hold the pose and then release slowly."
      ],
      "benefits": [
        "Stretches the chest, shoulders, and hips.",
        "Improves spinal flexibility and posture.",
        "Relieves stress and opens the heart center."
      ],
      "precautions": [
        "Avoid if you have neck, back, or knee injuries.",
        "Warm up your spine before attempting this pose.",
        "Use a block under your hands for support if needed."
      ]
    },
    {
      "pose_name": "Hanumanasana",
      "how_to_do_it": [
        "Start in a kneeling position with one leg forward and the other leg extended back.",
        "Slowly slide your front foot forward and your back foot backward, lowering your hips.",
        "Keep your torso upright and your arms reaching upward or resting on your hips.",
        "Hold the pose and breathe deeply, then switch sides."
      ],
      "benefits": [
        "Stretches the hamstrings, hips, and thighs.",
        "Improves flexibility and balance.",
        "Strengthens the pelvic region and lower back."
      ],
      "precautions": [
        "Avoid if you have hamstring or groin injuries.",
        "Use blocks for support if needed.",
        "Warm up your body thoroughly before attempting this pose."
      ]
    },
    {
      "pose_name": "Garudasana",
      "how_to_do_it": [
        "Stand upright and bend your knees slightly.",
        "Cross one leg over the other and wrap your foot around the calf.",
        "Bring your arms forward and cross them at the elbows, then wrap your forearms together.",
        "Hold the pose, then switch sides."
      ],
      "benefits": [
        "Improves balance and concentration.",
        "Stretches the shoulders, arms, and legs.",
        "Strengthens the thighs, calves, and ankles."
      ],
      "precautions": [
        "Avoid if you have knee or shoulder injuries.",
        "Use a wall for support if you struggle with balance.",
        "Keep your movements slow and controlled."
      ]
    },
    {
      "pose_name": "Garbha Pindasana",
      "how_to_do_it": [
        "Sit in Lotus Pose and slide your hands through the gaps between your thighs and calves.",
        "Bring your hands to your face and wrap them around your ears or chin.",
        "Balance on your hips and hold the pose.",
        "Rock gently if desired to massage your back."
      ],
      "benefits": [
        "Improves focus and balance.",
        "Strengthens the core and stretches the back.",
        "Calms the mind and enhances flexibility."
      ],
      "precautions": [
        "Avoid if you have knee or hip injuries.",
        "Ensure you can comfortably sit in Lotus Pose before attempting.",
        "Move gently to avoid strain."
      ]
    },
    {
      "pose_name": "Ganda Bherundasana",
      "how_to_do_it": [
        "Start in a forearm stand position.",
        "Bend your legs backward so your feet move toward your head.",
        "Lift your chest and head upward, creating a deep backbend.",
        "Hold the pose and then release gently."
      ],
      "benefits": [
        "Improves spinal flexibility and strength.",
        "Enhances balance and coordination.",
        "Builds upper body strength."
      ],
      "precautions": [
        "Avoid if you have back, neck, or shoulder injuries.",
        "Practice under the supervision of a qualified instructor.",
        "Warm up thoroughly before attempting this pose."
      ]
    },
    {
      "pose_name": "Eka Pada Rajakapotasana II",
      "how_to_do_it": [
        "Start in a lunge position with your back leg extended straight.",
        "Bend your back knee and reach your arms to grab your foot.",
        "Lift your chest and gaze upward, deepening the stretch.",
        "Hold the pose, then switch sides."
      ],
      "benefits": [
        "Stretches the hips, thighs, and shoulders.",
        "Improves posture and spinal flexibility.",
        "Strengthens the back and core muscles."
      ],
      "precautions": [
        "Avoid if you have knee, hip, or back injuries.",
        "Use a strap if you cannot reach your foot.",
        "Keep your movements controlled to avoid overstretching."
      ]
    },
    {
      "pose_name": "Eka Pada Rajakapotasana",
      "how_to_do_it": [
        "Start in a lunge position and lower your back knee to the floor.",
        "Slide your front foot toward the opposite side, bending the knee.",
        "Lower your hips toward the floor and extend your arms forward or upward.",
        "Hold the pose, then switch sides."
      ],
      "benefits": [
        "Opens the hips and stretches the thighs.",
        "Improves flexibility and balance.",
        "Relieves tension in the lower back."
      ],
      "precautions": [
        "Avoid if you have knee or hip injuries.",
        "Use a cushion under your hips for support.",
        "Ensure proper alignment to prevent strain."
      ]
    },
    {
      "pose_name": "Eka Pada Koundinyanasana II",
      "how_to_do_it": [
        "Start in a low lunge position with your hands on the floor.",
        "Place your elbows over your front knee and twist your torso.",
        "Lift your back leg off the ground and extend it straight.",
        "Balance on your hands and hold the pose."
      ],
      "benefits": [
        "Strengthens the arms, shoulders, and core.",
        "Improves balance and flexibility.",
        "Stretches the hips and spine."
      ],
      "precautions": [
        "Avoid if you have wrist or shoulder injuries.",
        "Practice on a stable, non-slip surface.",
        "Engage your core to maintain balance."
      ]
    },
    {
      "pose_name": "Eka Pada Koundinyanasana I",
      "how_to_do_it": [
        "Start in a plank position and bring one knee toward your elbow.",
        "Twist your torso and extend your other leg sideways.",
        "Balance on your hands while keeping your core engaged.",
        "Hold the pose and then switch sides."
      ],
      "benefits": [
        "Builds upper body and core strength.",
        "Improves focus and coordination.",
        "Enhances spinal flexibility and hip mobility."
      ],
      "precautions": [
        "Avoid if you have wrist or shoulder injuries.",
        "Use padding under your hands for comfort.",
        "Move slowly and mindfully to avoid strain."
      ]
    },
    {
      "pose_name": "Dwi Pada Viparita Dandasana",
      "how_to_do_it": [
        "Start in a backbend position with your hands and feet on the floor.",
        "Lower your forearms to the floor and interlace your fingers.",
        "Lift your chest and hips upward, creating a deep arch.",
        "Hold the pose and then release gently."
      ],
      "benefits": [
        "Stretches the chest, shoulders, and spine.",
        "Strengthens the back, arms, and legs.",
        "Improves posture and flexibility."
      ],
      "precautions": [
        "Avoid if you have back or shoulder injuries.",
        "Practice under the guidance of an instructor.",
        "Warm up thoroughly before attempting this pose."
      ]
    },
    {
      "pose_name": "Durvasasana",
      "how_to_do_it": [
        "Stand upright and lift one leg, placing your foot behind your head.",
        "Balance on your standing leg while keeping your spine straight.",
        "Bring your palms together in a prayer position.",
        "Hold the pose and then switch sides."
      ],
      "benefits": [
        "Improves balance and flexibility.",
        "Strengthens the legs and core muscles.",
        "Enhances focus and concentration."
      ],
      "precautions": [
        "Avoid if you have hip, knee, or back injuries.",
        "Practice near a wall for support if needed.",
        "Move gently to avoid strain."
      ]
    },
    {
      "pose_name": "Dandasana",
      "how_to_do_it": [
        "Sit on the floor with your legs extended straight in front of you.",
        "Place your palms on the floor beside your hips.",
        "Keep your back straight and your toes pointing upward.",
        "Hold the pose while breathing deeply."
      ],
      "benefits": [
        "Strengthens the back and abdominal muscles.",
        "Improves posture and alignment.",
        "Stretches the shoulders and chest."
      ],
      "precautions": [
        "Avoid if you have lower back pain or injuries.",
        "Use a cushion under your hips if needed.",
        "Keep your spine elongated to avoid slouching."
      ]
    },
    {
      "pose_name": "Chaturanga Dandasana",
      "how_to_do_it": [
        "Start in a plank position with your body in a straight line.",
        "Lower your body halfway down, keeping your elbows close to your sides.",
        "Engage your core and hold your body parallel to the floor.",
        "Breathe deeply and then release back to the plank position."
      ],
      "benefits": [
        "Strengthens the arms, shoulders, and core.",
        "Prepares the body for arm balances.",
        "Improves overall stability and posture."
      ],
      "precautions": [
        "Avoid if you have wrist or shoulder injuries.",
        "Maintain proper alignment to avoid strain.",
        "Engage your core to support your lower back."
      ]
    },
    {
      "pose_name": "Chakravakasana",
      "how_to_do_it": [
        "Begin on your hands and knees in a tabletop position.",
        "Inhale as you arch your back and lift your head and tailbone.",
        "Exhale as you round your spine and tuck your chin toward your chest.",
        "Repeat the movement several times, synchronizing with your breath."
      ],
      "benefits": [
        "Improves flexibility in the spine.",
        "Relieves tension in the back and shoulders.",
        "Promotes relaxation and mindfulness."
      ],
      "precautions": [
        "Avoid if you have severe wrist or knee issues.",
        "Keep movements slow and controlled.",
        "Use padding under your knees for comfort."
      ]
    },
    {
      "pose_name": "Camatkarasana",
      "how_to_do_it": [
        "Start in a side plank position with one arm supporting your body.",
        "Lift your top leg and step it behind you, placing your foot on the floor.",
        "Arch your back and lift your chest toward the ceiling.",
        "Extend your top arm overhead and hold the pose."
      ],
      "benefits": [
        "Opens the chest and shoulders.",
        "Improves spinal flexibility and balance.",
        "Strengthens the arms, legs, and core."
      ],
      "precautions": [
        "Avoid if you have wrist or shoulder injuries.",
        "Practice on a stable surface to prevent slipping.",
        "Engage your core to maintain balance."
      ]
    },
    {
      "pose_name": "Bitilasana",
      "how_to_do_it": [
        "Begin on your hands and knees in a tabletop position.",
        "Inhale as you drop your belly toward the floor and lift your head and tailbone.",
        "Keep your arms straight and gaze forward.",
        "Hold for a moment, then transition into a different pose or repeat."
      ],
      "benefits": [
        "Improves spinal flexibility.",
        "Stretches the abdomen and chest.",
        "Relieves tension in the neck and back."
      ],
      "precautions": [
        "Avoid if you have wrist or knee pain.",
        "Use a cushion under your knees for added comfort.",
        "Maintain smooth and gentle movements."
      ]
    },
    {
      "pose_name": "Bhujapidasana",
      "how_to_do_it": [
        "Start in a squatting position with your feet slightly apart.",
        "Place your hands on the floor, shoulder-width apart.",
        "Lift your hips and slide your knees onto your upper arms.",
        "Balance your body on your hands and hold the pose."
      ],
      "benefits": [
        "Strengthens the arms and shoulders.",
        "Improves core stability.",
        "Enhances focus and balance."
      ],
      "precautions": [
        "Avoid if you have wrist or shoulder injuries.",
        "Use a yoga block for additional support if needed.",
        "Warm up your wrists and arms before attempting."
      ]
    },
    {
      "pose_name": "Bhujangasana",
      "how_to_do_it": [
        "Lie on your stomach with your palms under your shoulders.",
        "Inhale as you lift your chest off the ground, keeping your elbows slightly bent.",
        "Press your shoulders down and keep your gaze forward.",
        "Hold the pose and then lower yourself back down."
      ],
      "benefits": [
        "Stretches the chest, shoulders, and abdomen.",
        "Strengthens the spine and improves posture.",
        "Relieves tension in the lower back."
      ],
      "precautions": [
        "Avoid if you have severe back or neck injuries.",
        "Keep your elbows slightly bent to avoid overextension.",
        "Engage your core to protect your lower back."
      ]
    },
    {
      "pose_name": "Bharadvajasana I",
      "how_to_do_it": [
        "Sit on the floor with your legs extended in front of you.",
        "Bend your knees and bring your feet to one side, resting on your hip.",
        "Twist your torso toward the opposite side, placing your hand on the floor behind you.",
        "Hold the pose and then switch sides."
      ],
      "benefits": [
        "Improves spinal flexibility and mobility.",
        "Relieves tension in the back and shoulders.",
        "Stimulates the digestive organs."
      ],
      "precautions": [
        "Avoid if you have back or hip injuries.",
        "Keep your movements gentle to avoid strain.",
        "Use a cushion for support if needed."
      ]
    },
    {
      "pose_name": "Bhairavasana",
      "how_to_do_it": [
        "Start in a seated position with one leg bent and the other leg extended.",
        "Lift your extended leg and place it behind your head.",
        "Rest your hands on the floor for balance and maintain the pose.",
        "Switch sides and repeat."
      ],
      "benefits": [
        "Enhances flexibility in the hips and spine.",
        "Improves balance and focus.",
        "Strengthens the arms and core muscles."
      ],
      "precautions": [
        "Avoid if you have hip, knee, or spinal injuries.",
        "Warm up thoroughly before attempting this pose.",
        "Practice under the supervision of an experienced instructor."
      ]
    },
    {
      "pose_name": "Balasana",
      "how_to_do_it": [
        "Kneel on the floor and sit back on your heels.",
        "Extend your arms forward and lower your forehead to the ground.",
        "Relax your shoulders and breathe deeply.",
        "Hold the pose for several breaths or longer."
      ],
      "benefits": [
        "Stretches the back, hips, and thighs.",
        "Relieves tension and promotes relaxation.",
        "Calms the mind and reduces stress."
      ],
      "precautions": [
        "Avoid if you have knee or ankle injuries.",
        "Use a cushion under your hips if needed.",
        "Avoid excessive pressure on your forehead."
      ]
    },
    {
      "pose_name": "Baddha Konasana",
      "how_to_do_it": [
        "Sit on the floor with your legs extended.",
        "Bend your knees and bring the soles of your feet together.",
        "Hold your feet with your hands and gently press your knees toward the floor.",
        "Sit upright and hold the pose."
      ],
      "benefits": [
        "Stretches the inner thighs and groin.",
        "Improves hip flexibility.",
        "Relieves tension in the lower back."
      ],
      "precautions": [
        "Avoid if you have groin or knee injuries.",
        "Use a cushion under your hips for support.",
        "Move gently to avoid strain."
      ]
    },
    {
      "pose_name": "Astavakrasana",
      "how_to_do_it": [
        "Start in a seated position with your legs extended forward.",
        "Bend your right knee and place your right foot over your left thigh.",
        "Lift your body off the ground using your hands, balancing on your arms.",
        "Extend your legs to the side and hold the pose."
      ],
      "benefits": [
        "Strengthens the arms and shoulders.",
        "Improves core stability.",
        "Enhances balance and focus."
      ],
      "precautions": [
        "Avoid if you have wrist or shoulder injuries.",
        "Ensure proper arm alignment to prevent strain.",
        "Practice under the guidance of an instructor."
      ]
    },
    {
      "pose_name": "Ashtanga Namaskara",
      "how_to_do_it": [
        "Start in a plank position with your body in a straight line.",
        "Lower your knees, chest, and chin to the floor, keeping your elbows close to your sides.",
        "Hold the pose briefly, then transition to another pose."
      ],
      "benefits": [
        "Strengthens the arms, chest, and shoulders.",
        "Prepares the body for more advanced poses.",
        "Enhances focus and discipline."
      ],
      "precautions": [
        "Avoid if you have wrist or shoulder injuries.",
        "Maintain proper alignment to avoid strain.",
        "Engage your core to support your lower back."
      ]
    },
    {
      "pose_name": "Ardha Uttanasana",
      "how_to_do_it": [
        "Stand with your feet hip-width apart and fold forward at the hips.",
        "Place your hands on your shins or the floor, keeping your back straight.",
        "Lift your chest slightly to lengthen your spine.",
        "Hold the pose for a few breaths, then release."
      ],
      "benefits": [
        "Stretches the hamstrings and spine.",
        "Improves posture and alignment.",
        "Calms the mind and relieves stress."
      ],
      "precautions": [
        "Avoid rounding your back to prevent strain.",
        "Use blocks for support if needed.",
        "Avoid if you have lower back injuries."
      ]
    },
    {
      "pose_name": "Ardha Pincha Mayurasana",
      "how_to_do_it": [
        "Begin in a tabletop position with your forearms on the ground.",
        "Lift your hips toward the ceiling, straightening your legs.",
        "Keep your head off the ground and gaze toward your feet.",
        "Hold the pose for a few breaths, then release."
      ],
      "benefits": [
        "Strengthens the arms and shoulders.",
        "Improves flexibility in the hamstrings.",
        "Calms the mind and reduces stress."
      ],
      "precautions": [
        "Avoid if you have shoulder or neck injuries.",
        "Keep your shoulders engaged to avoid strain.",
        "Use a wall for support if needed."
      ]
    },
    {
      "pose_name": "Ardha Matsyendrasana",
      "how_to_do_it": [
        "Sit on the floor with your legs extended.",
        "Bend your right knee and place your right foot over your left thigh.",
        "Twist your torso to the right, placing your right hand on the floor behind you.",
        "Hold the pose and then switch sides."
      ],
      "benefits": [
        "Improves spinal flexibility and mobility.",
        "Stimulates the digestive organs.",
        "Relieves tension in the back and shoulders."
      ],
      "precautions": [
        "Avoid if you have back or spinal injuries.",
        "Keep your movements gentle to avoid strain.",
        "Use a cushion for support if needed."
      ]
    },
    {
      "pose_name": "Ardha Bhekasana",
      "how_to_do_it": [
        "Lie on your stomach with your legs extended.",
        "Bend one knee and reach back to hold your foot with your hand.",
        "Lift your chest slightly off the ground, keeping your gaze forward.",
        "Hold the pose and then switch sides."
      ],
      "benefits": [
        "Stretches the thighs, chest, and shoulders.",
        "Improves flexibility in the hip flexors.",
        "Relieves tension in the lower back."
      ],
      "precautions": [
        "Avoid if you have knee or shoulder injuries.",
        "Move gently to avoid overstraining.",
        "Use a strap if you cannot reach your foot."
      ]
    },
    {
      "pose_name": "Anantasana",
      "how_to_do_it": [
        "Lie on your side with your legs extended.",
        "Lift your top leg and hold your foot with your hand.",
        "Keep your body in a straight line and balance on your side.",
        "Hold the pose and then switch sides."
      ],
      "benefits": [
        "Improves balance and coordination.",
        "Strengthens the core and legs.",
        "Enhances flexibility in the hamstrings."
      ],
      "precautions": [
        "Avoid if you have neck or shoulder injuries.",
        "Practice on a stable surface to maintain balance.",
        "Use a strap if you cannot reach your foot."
      ]
    },
    {
      "pose_name": "Ananda Balasana",
      "how_to_do_it": [
        "Lie on your back and bend your knees toward your chest.",
        "Hold the outer edges of your feet with your hands.",
        "Gently pull your knees toward your armpits, keeping your back flat.",
        "Hold the pose and breathe deeply."
      ],
      "benefits": [
        "Stretches the inner thighs, hips, and lower back.",
        "Calms the mind and reduces stress.",
        "Improves flexibility in the groin area."
      ],
      "precautions": [
        "Avoid if you have knee or hip injuries.",
        "Move gently to avoid overstraining.",
        "Use a strap for assistance if needed."
      ]
    },
    {
      "pose_name": "Adho Mukha Vriksasana",
      "how_to_do_it": [
        "Start in a downward-facing dog pose.",
        "Walk your feet closer to your hands and lift one leg toward the ceiling.",
        "Kick up with the other leg and balance on your hands.",
        "Hold the pose, then slowly lower your legs back down."
      ],
      "benefits": [
        "Strengthens the arms, shoulders, and core.",
        "Improves balance and concentration.",
        "Enhances overall body awareness."
      ],
      "precautions": [
        "Avoid if you have wrist or shoulder injuries.",
        "Practice against a wall for support if needed.",
        "Warm up your wrists and shoulders before attempting."
      ]
    },
    {
      "pose_name": "Virabhadrasana III",
      "how_to_do_it": [
        "Start in Warrior I pose with your right foot forward.",
        "Shift your weight onto your right foot and lift your left leg straight behind you.",
        "Extend your arms forward or keep them at your sides for balance.",
        "Keep your body parallel to the ground, forming a straight line from your head to your left heel.",
        "Hold the pose for a few breaths, then switch sides."
      ],
      "benefits": [
        "Strengthens the legs, core, and back.",
        "Improves balance and stability.",
        "Enhances focus and concentration."
      ],
      "precautions": [
        "Avoid if you have knee or ankle injuries.",
        "Keep a slight bend in the standing knee to prevent hyperextension.",
        "Use a wall or chair for support if needed."
      ]
    },
    {
      "pose_name": "Virabhadrasana II",
      "how_to_do_it": [
        "Stand with your feet wide apart and turn your right foot out 90 degrees.",
        "Bend your right knee so it is directly above your ankle.",
        "Stretch your arms out to the sides, parallel to the floor.",
        "Keep your gaze over your right hand and hold the pose."
      ],
      "benefits": [
        "Strengthens the legs, hips, and core.",
        "Increases stamina and endurance.",
        "Improves flexibility in the hips and shoulders."
      ],
      "precautions": [
        "Avoid if you have knee or hip injuries.",
        "Keep your front knee aligned with your ankle.",
        "Engage your core to protect your lower back."
      ]
    },
    {
      "pose_name": "Virabhadrasana I",
      "how_to_do_it": [
        "Stand with your feet wide apart and turn your right foot out 90 degrees.",
        "Bend your right knee so it is directly above your ankle.",
        "Lift your arms overhead, keeping your palms together or shoulder-width apart.",
        "Square your hips toward the front and hold the pose."
      ],
      "benefits": [
        "Strengthens the legs, arms, and back.",
        "Stretches the chest, shoulders, and groin.",
        "Improves focus and balance."
      ],
      "precautions": [
        "Avoid if you have knee or back injuries.",
        "Keep your front knee aligned with your ankle.",
        "Avoid over-arching your lower back by engaging your core."
      ]
    }
  ]
}
